Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.SnapDistance Property
 The snap distance. Use 0.0 for manual connectivity, positive value for automatic connectivity.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double SnapDistance { get; set; }
Public Property SnapDistance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace